//=============================================================================
//
// シャドウ処理 [shadow.h]
// Author : Okabe Kazuki
//
//=============================================================================
#ifndef _SHADOW_H_
#define _SHADOW_H_

#include "main.h"
#include "scene.h"
//******************************************************************************************************************************
// 3Dポリゴンのクラス
//******************************************************************************************************************************
class CShadow
{
public:
//	CShadow();
//	~CShadow();

	static void SetShadow(LPD3DXMESH Mesh, DWORD NumMat, D3DXMATRIX mtxWorld,D3DXVECTOR3 *pPos);
private:
};
#endif
#pragma once
