#pragma once
//=============================================================================
//
// テクスチャの処理 [Texture.h]
// Author : Ryota Kinoshita
//
//=============================================================================
#ifndef _TEXTURE_H_
#define _TEXTURE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//====================================
// テクスチャクラス
//====================================
class CTexture
{
public:
	CTexture();
	~CTexture();
	static CTexture *Create(void);

	HRESULT Load(void);
	void UnLoad();

private:

};
#endif