//=============================================================================
//
// ライフ処理 [life.h]
// Author : Kishida Rei
//
//=============================================================================
#ifndef _LIFE_H_
#define _LIFE_H_

#include "main.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_LIFE (5)

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	int nLife;			//プレイヤーの体力
	bool bUse;			//使用されているか
}LIFE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitLife(void);
void UninitLife(void);
void UpdateLife(void);
void DrawLife(void);
//LIFE *GetLife(void);

//void RemoveLife(int nDamage, int nCntLife);
//void SetLife(D3DXVECTOR3 pos);
void AddLife(int nLife);

LIFE *GetLife(void);
#endif
