//=============================================================================
//
// スタミナ処理 [stamina.h]
// Author : KishidaRei
//
//=============================================================================
#ifndef _STAMINA_H_
#define _STAMINA_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	MAX_STAMINA	(128)	// ポーズの最大数



//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXCOLOR col;
	bool bUse;			//使用しているかどうか
	int nType;
}STAMINA;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitStamina(void);
void UnInitStamina(void);
void UpdateStamina(void);
void DrawStamina(void);


 





//void SetPause(D3DXVECTOR3 pos, int nType, float fSpeed);

#endif