////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// ヒット処理 [hit.h]
// Author : Ryota Kinoshita
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#ifndef _HIT_H_
#define _HIT_H_

#include "main.h"
//******************************************************************************************************************************
// 構造体定義
//******************************************************************************************************************************
typedef enum
{
	HITTEX_BG = 0,	// 背景
	HITTEX_HITTEXT,	// ヒット
	HITTEX_HIT,		// ヒット数
	HITTEX_MAX,		// 最大数
}HITTEX;
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXCOLOR col;			// 色
	HITTEX nType;			// 種類
	float fWidth;			// 幅
	float fHeight;			// 高さ
	bool bUse;				// 使用されているかどうが
}Hit;
//******************************************************************************************************************************
// プロトタイプ宣言
//******************************************************************************************************************************
void InitHit(void);
void UninitHit(void);
void UpdateHit(void);
void DrawHit(void);
void SetHit(D3DXVECTOR3 pos, D3DXCOLOR col, HITTEX nType, float fWidth, float fHeight);
void AddHit(int nHit);
#endif
