////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// メッシュ筒処理 [meshCylinder.h]
// Author : Ryota Kinoshita
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#ifndef _MESHCYLINDER_H_
#define _MESHCYLINDER_H_

#include "main.h"
//******************************************************************************************************************************
// 構造体定義
//******************************************************************************************************************************
typedef enum
{
	MESHCYLINDERTYPE_SEA = 0,
	MESHCYLINDERTYPE_MAX
}MESHCYLINDERTYPE;

typedef struct
{
	D3DXVECTOR3 pos;	// 位置
	D3DXVECTOR3 rot;	// 向き
	D3DXMATRIX mtxWorld;// ワールドマトリックス
	float fWidth;		// 幅
	float fHeight;		// 高さ
	float fDepth;		// 奥行き
	float fLength;		// 半径
	MESHCYLINDERTYPE nType;	// 種類
	bool bUse;			// 使用されているかどうか
}MeshCylinder;

//******************************************************************************************************************************
// プロトタイプ宣言
//******************************************************************************************************************************
void InitMeshCylinder(void);
void UninitMeshCylinder(void);
void UpdateMeshCylinder(void);
void DrawMeshCylinder(void);
#endif
