////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// スコア処理 [score.h]
// Author : Ryota Kinoshita
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#ifndef _SCORE_H_
#define _SCORE_H_

#include "main.h"
//******************************************************************************************************************************
// 構造体定義
//******************************************************************************************************************************
typedef enum
{
	SCORETEX_SCORE_BG = 0,	// スコアの背景
	SCORETEX_SCORE_NAME,	// スコア名前
	SCORETEX_SCORE,			// スコア
	SCORETEX_MAX,			// 最大数
}SCORETEX;
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXCOLOR col;			// 色
	SCORETEX nType;			// 種類
	float fWidth;			// 幅
	float fHeight;			// 高さ
	bool bUse;				// 使用されているかどうが
}Score;
//******************************************************************************************************************************
// プロトタイプ宣言
//******************************************************************************************************************************
void InitScore(void);
void UninitScore(void);
void UpdateScore(void);
void DrawScore(void);
void SetScore(D3DXVECTOR3 pos, D3DXCOLOR col, SCORETEX nType, float fWidth, float fHeight);
int AddScore(int nValue);
#endif
