////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// UI処理 [UI.h]
// Author : Ryota Kinoshita
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#ifndef _UI_H_
#define _UI_H_

#include "main.h"
//******************************************************************************************************************************
// 構造体定義
//******************************************************************************************************************************
typedef enum
{
	UITEX_BG = 0,			// 背景
	UITEX_BG1,				// 背景
	UITEX_RESULT,			// 結果黒帯
	UITEX_GAMECLEAR,		// ゲームクリア
	UITEX_GAMEOVER,			// ゲームオーバー
	UITEX_BOTTON,
	UITEX_LANCE,
	UITEX_SORD,
	UITEX_HAMMER,
	UITEX_PUNCH,
	UITEX_MAX,				// 最大数
}UITEX;
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXCOLOR col;			// 色
	UITEX nType;			// 種類
	float fWidth;			// 幅
	float fHeight;			// 高さ
	bool bUse;				// 使用されているかどうが
}UI;
//******************************************************************************************************************************
// プロトタイプ宣言
//******************************************************************************************************************************
void InitUI(void);
void UninitUI(void);
void UpdateUI(void);
void DrawUI(void);
void SetUI(D3DXVECTOR3 pos, D3DXCOLOR col, UITEX nType, float fWidth, float fHeight);
UI *GetUI(void);
#endif
