//=============================================================================
//
// タイトル処理 [title.cpp]
// Author :岸田怜(Kishida Rei)
//
//=============================================================================
#include "main.h"
#include "renderer.h"
#include "scene.h"
#include "scene2D.h"
#include "manager.h"
#include "input.h"
#include "title.h"
#include "fade.h"
#include "object.h"
#include "scene_meshfield.h"
#include "titlelogo.h"
//****************************************************************************
// 静的メンバ変数
//*****************************************************************************
CTitleLogo *CTitle::m_pTitleLogo = NULL;
CObject *CTitle::m_pObject = NULL;				//オブジェクト
CSceneMeshField *CTitle::m_pMeshField = NULL;			//メッシュフィールド


//=============================================================================
// 関数名：コンストラクタ
// 関数の概要：生成されたときに呼び出される。値のクリア
//=============================================================================
CTitle::CTitle()
{

}

//=============================================================================
// 関数名：デストラクタ
// 関数の概要：最後に呼び出される
//=============================================================================
CTitle::~CTitle()
{

}




//=============================================================================
// 関数名：タイトルの初期化処理
// 関数の概要：使用するテクスチャやモデルの読み込み
//=============================================================================
HRESULT CTitle::Init(void)
{
	//タイトルロゴのテクスチャの読み込み
	CTitleLogo::Load();

	//オブジェクトのテクスチャの読み込み
	CObject::Load();

	//メッシュフィールドのテクスチャの読み込み
	CSceneMeshField::Load();


	//タイトルロゴの生成
	CTitleLogo::Create();

	//モデルの生成
	CObject::LoadModelText();

	//メッシュフィールドの生成
	CSceneMeshField::Create(D3DXVECTOR3(1850.0f, -0.5f, -200.0f), 45, 4, 100.0f, 100.0f, CSceneMeshField::FIELDTYPE_NORMAL);		//最初の床
	CSceneMeshField::Create(D3DXVECTOR3(3900.0f, -0.5f, -1900.0f), 10, 30, 100.0f, 100.0f, CSceneMeshField::FIELDTYPE_NORMAL);	//次の床
	CSceneMeshField::Create(D3DXVECTOR3(4100.0f, -0.5f, -3800.0f), 9, 10, 100.0f, 100.0f, CSceneMeshField::FIELDTYPE_NORMAL);	//ボスの床
	CSceneMeshField::Create(D3DXVECTOR3(2000.0f, -0.4f, -80.0f), 200, 1, 30.0f, 30.0f, CSceneMeshField::FIELDTYPE_YELLOW);

	return S_OK;

}
//=============================================================================
// 関数名：タイトルの終了処理
// 関数の概要：使用するテクスチャやモデルの破棄、シーンの破棄
//=============================================================================
void CTitle::Uninit()
{
	//タイトルロゴのテクスチャの破棄
	CTitleLogo::Unload();

	//オブジェクトのテクスチャの破棄
	CObject::Unload();

	//メッシュフィールドのテクスチャの読み込み
	CSceneMeshField::Unload();

	//シーンの破棄
	CScene::ReleaseSceneAll();


}
//=============================================================================
// 関数名：タイトルの更新処理
// 関数の概要：--
//=============================================================================
void CTitle::Update()
{
	//フェードの取得
	CFade::FADE pFade;
	pFade = CFade::GetFade();


	//デバイスの取得
	CInputKeyboard *pInputKeyboard;
	pInputKeyboard = CManager::GetInputKeyboard();





}

//=============================================================================
// 関数名：タイトルの描画処理
// 関数の概要：--
//=============================================================================
void CTitle::Draw()
{


}
