//=============================================================================
//
// エフェクト処理 [effect.h]
// Author : 
//
//=============================================================================
#ifndef _EFFECT_H_
#define _EFFECT_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_EFFECT (800)



//*****************************************************************************
// 壁の構造体
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;		//位置(中心座標)
	D3DXVECTOR3 rot;		//回転
	D3DXCOLOR col;			//色
	D3DXMATRIX mtxWorld;	//ワールドマトリックス
	int nLife;				//ライフ
	bool bUse;				//使用しているか
	float fRadius;			//半径
}EFFECT;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitEffect(void);		//エフェクト初期化
void UninitEffect(void);	//エフェクト終了
void UpdateEffect(void);	//エフェクト更新
void DrawEffect(void);		//エフェクト描画

void SetEffect(D3DXVECTOR3 pos, float fRadius, int nLife, D3DXCOLOR col);
#endif
