//=============================================================================
//
// ポーズ処理 [pause.h]
// Author : KishidaRei
//
//=============================================================================
#ifndef _PAUSE_H_
#define _PASUSE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	MAX_PAUSE	(128)	// ポーズの最大数



//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXCOLOR col;		//カラー
	//bool bUse;			//使用しているかどうか
}PAUSE;


typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXCOLOR col;
	bool bUse;			//使用しているかどうか
}PAUSE2;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPause(void);
void UnInitPause(void);
void UpdatePause();
void DrawPause(void);

 

//void SetPause(D3DXVECTOR3 pos, int nType, float fSpeed);

#endif