//=============================================================================
//
// 結果画面処理 [result.h]
// Author : KishidaRei
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

#include "main.h"
#include "input.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResult(void);
void UnInitResult(void);
void UpdateResult(void);
void DrawResult(void);


#endif
