//=============================================================================
//
// タイマー処理 [timer.h]
// Author : Kishida Rei
//
//=============================================================================
#ifndef _TIMER_H_
#define _TIMER_H_

#include "main.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	int nCounter;	//状態管理のカウンター
	int nTime;		//タイム
}TIMER;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTimer(void);
void UninitTimer(void);
void UpdateTimer(void);
void DrawTimer(void);

//void RemoveTimer(int nValue);

TIMER GetTimer(void);


#endif
