//=============================================================================
//
// スコア処理 [score.h]
// Author : komatsu
//
//=============================================================================
#ifndef _SCORE_H_
#define _SCORE_H_

#include "main.h"

//=============================================================================
// スコアの構造体
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;		//位置
	D3DXCOLOR col;			//色
	int nScore;				//スコア
}SCORE;
//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitScore(void);
void UninitScore(void);
void UpdateScore(void);
void DrawScore(void);

void AddScore(int nValue);
SCORE GetScore(void);
#endif
