//***************************************************************************//
//
// ギャラリー処理 [Gallery.h]
// Author : TEAM_Fascinator
//
//***************************************************************************//
#ifndef _GALLERY_H_
#define _GALLERY_H_

#include "main.h"

//***************************************************************************//
// プロトタイプ宣言(Gallery)
//***************************************************************************//
void InitGallery(void);
void UninitGallery(void);
void UpdateGallery(void);
void DrawGallery(void);
#endif