//***************************************************************************//
//
// オプション処理 [Option.h]
// Author : TEAM_Fascinator
//
//***************************************************************************//
#ifndef _OPTION_H_
#define _OPTION_H_

#include "main.h"

//***************************************************************************//
// プロトタイプ宣言(Option)
//***************************************************************************//
void InitOption(void);
void UninitOption(void);
void UpdateOption(void);
void DrawOption(void);
#endif