//=============================================================================
//
// 背景処理 [Pause.h]
// Author :TEAM_Fascinator
//
//=============================================================================
#ifndef _SELECT_H_ //二十インクルード防止のマクロ定義
#define _SELECT_H_

#include "main.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef enum
{
	STAGESERECTSATE_NONE = 0,
	STAGESERECTSATE_YES,	//次の階に進む
	STAGESERECTSATE_NO,		//進まない
	STAGESERECTSATE_MAX

} STAGESERECTSTATE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitSelect(void);
void UninitSelect(void);
void UpdateSelect(void);
void DrawSelect(void);
#endif
