//=============================================================================
//
// 背景処理 [SelectBG.h]
// Author :TEAM_Fascinator
//
//=============================================================================
#ifndef _SELECTBG_H_ //二十インクルード防止のマクロ定義
#define _SELECTBG_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitSelectBG(void);
void UninitSelectBG(void);
void UpdateSelectBG(void);
void DrawSelectBG(void);
#endif
