////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// 空の処理 [sky.h]
// Author : Ryota Kinoshita
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#ifndef _SKY_H_
#define _SKY_H_

#include "main.h"
//******************************************************************************************************************************
// 構造体定義
//******************************************************************************************************************************
typedef enum
{
	SKYTYPE_0 = 0,
	SKYTYPE_MAX
}SKYTYPE;

typedef struct
{
	LPDIRECT3DVERTEXBUFFER9 pVtxBuff = NULL;						// 頂点バッファへのポインタ
	LPDIRECT3DINDEXBUFFER9 pIdxBuff = NULL;						// インデックスバッファへのポインタ
	int nNumVertex;	// 頂点数
	int nNumIndex;	// インデックス数
	int nNumPolygon;	// ポリゴン数

	D3DXVECTOR3 pos;	// 位置
	D3DXVECTOR3 rot;	// 向き
	D3DXCOLOR col;		// 色
	D3DXMATRIX mtxWorld;// ワールドマトリックス
	float fWidth;		// 幅
	float fHeight;		// 高さ
	float fDepth;		// 奥行き
	float fLength;		// 半径
	SKYTYPE nType;	// 種類
	bool bUse;			// 使用されているかどうか
}Sky;

//******************************************************************************************************************************
// プロトタイプ宣言
//******************************************************************************************************************************
void InitSky(void);
void UninitSky(void);
void UpdateSky(void);
void DrawSky(void);
void SetSky(D3DXVECTOR3 pos,float fLength);
#endif
